package com.example.enotita_4_7;

import java.util.ArrayList;

public class DataSource {

    public static ArrayList<Recipe> getAllRecipes() {
        ArrayList<Recipe> recipes = new ArrayList<>();

        recipes.add(new Recipe("Healthy κοτομπουκιές στον φούρνο", "Συστατικά\n" +
                "Για τη μαρινάδα\n" +
                "\n" +
                "650 γρ. φιλέτο στήθος κοτόπουλο\n" +
                "αλάτι\n" +
                "πιπέρι\n" +
                "1 κ.σ. θυμάρι\n" +
                "2 σκ. σκόρδο\n" +
                "250 γρ. ξινόγαλο\n" +
                "Για το πανάρισμα\n" +
                "\n" +
                "200 γρ. πάνκο ή φρυγανιά τριμμένη\n" +
                "1 κ.γ. κάρι\n" +
                "1 κ.γ. πάπρικα\n" +
                "1 κ.γ. σκόρδο σε σκόνη\n" +
                "1 κ.σ. θυμάρι ξηρό\n" +
                "αλάτι\n" +
                "πιπέρι\n" +
                "2 κ.σ. ελαιόλαδο\n" +
                "Για τη σάλτσα\n" +
                "\n" +
                "150 γρ. γιαούρτι στραγγιστό\n" +
                "1 κ.γ. κάρι\n" +
                "1 κ.γ. μουστάρδα\n" +
                "1 κ.γ. μέλι\n" +
                "Για το σερβίρισμα\n" +
                "\n" +
                "φέτες από λάιμ\n" +
                "ρίγανη\n" +
                "θυμάρι\n" +
                "βασιλικό\n" +
                "\nΜέθοδος Εκτέλεσης\n" +
                "\nΓια τη μαρινάδα\n" +
                "\n" +
                "Κόβουμε το κοτόπουλο σε λεπτές λωρίδες με πάχος 1-2 εκ.\n" +
                "Βάζουμε τις λωρίδες σε ένα μπολ και προσθέτουμε αλάτι, πιπέρι και ανακατεύουμε.\n" +
                "Προσθέτουμε θυμάρι, τα σκόρδα κομμένα σε κομμάτια, το ξινόγαλο και ανακατεύουμε.\n" +
                "Καλύπτουμε με μεμβράνη και βάζουμε στο ψυγείο για 6-12 ώρες.\n" +
                "Για τη μαρινάδα\n" +
                "\n" +
                "Προθερμαίνουμε τον φούρνο στους 220ο C στον αέρα.\n" +
                "Σε ένα μπολ βάζουμε το πάνκο, το κάρι, την παάπρικα, το σκόρδο, το θυμάρι και ανακατεύουμε.\n" +
                "Βάζουμε το μαριναρισμένο κοτόπουλο στο μπολ με τη μαρινάδα και ανακατεύουμε ώστε να καλυφθεί όλη η επιφάνεια από τις λωρίδες του κοτόπουλου.\n" +
                "Απλώνουμε το κοτόπουλο σε ταψιά με λαδόκολλα, βάζουμε αλάτι, πιπέρι, το ελαιόλαδο και ψήνουμε για 8-10 λεπτά.\n" +
                "Για τη σάλτσα\n" +
                "\n" +
                "Σε ένα μπολ βάζουμε το γιαούρτι, το κάρι, τη μουστάρδα, το μέλι και ανακατεύουμε καλά να ομογενοποιηθούν τα υλικά.\n" +
                "Σερβίρουμε τις κοτομπουκιές με φέτες λάιμ, ρίγανη, θυμάρι και βασιλικό.\n", R.drawable.kotompoukies));
        recipes.add(new Recipe("Rice paper wraps", "Συστατικά\n" +
                "1 καρότο\n" +
                "1 πιπεριά κόκκινη\n" +
                "1 ραντίτσιο\n" +
                "φύλλα βασιλικού + έξτρα, για το σερβίρισμα\n" +
                "αλάτι\n" +
                "πιπέρι\n" +
                "1 κ.γ. σησαμέλαιο\n" +
                "10 φύλλα ρυζιού\n" +
                "γλυκόξινη σάλτσα, για το σερβίρισμα\n" +
                "φέτες από λάιμ, για το σερβίρισμα\n" +
                "\nΜέθοδος Εκτέλεσης\n" +
                "Κόβουμε το καρότο σε λεπτές λωρίδες πάχους 1 εκ. και τις βάζουμε σε ένα μπολ.\n" +
                "Κόβουμε την πιπεριά σε λωρίδες όπως το καρότο και τις βάζουμε στο μπολ.\n" +
                "Κόβουμε το ραντίτσιο στη μέση, το κόβουμε σε λεπτές φέτες πάχους 0,5 εκ. και το βάζουμε στο μπολ με τα υπόλοιπα λαχανικά.\n" +
                "Προσθέτουμε τα φύλλα βασιλικού, το αλάτι, το πιπέρι, το σησαμέλαιο και ανακατεύουμε τα λαχανικά στο μπολ με μια κουτάλα.\n" +
                "Γεμίζουμε ένα μεγάλο μπολ με κρύο νερό. Βουτάμε ένα φύλλο ρυζιού στο μπολ και αφήνουμε για 5 δευτερόλεπτα μέσα στο νερό μέχρι να αρχίσει να μαλακώνει ελαφρά. Δεν θέλουμε να μαλακώσει πολύ ώστε να μπορέσουμε να το ρολάρουμε.\n" +
                "Αφαιρούμε το φύλλο από το μπολ και το αφήνουμε πάνω από μια πετσέτα κουζίνας.\n" +
                "Παίρνουμε λίγα από τα λαχανικά και τα τοποθετούμε στο κέντρο του φύλλου.\n" +
                "Διπλώνουμε τη μια μεριά του φύλλου ώστε να καλύψει τη γέμιση. Στη συνέχεια διπλώνουμε τις δύο κάθετες μεριές. Έπειτα ρολάρουμε το φύλλο με τη γέμιση μέχρι να κλείσει και να δημιουργηθεί ένα ρολάκι.\n" +
                "Μεταφέρουμε σε ένα πιάτο και επαναλαμβάνουμε την ίδια διαδικασία για τα υπόλοιπα φύλλα ρυζιού.\n" +
                "Σερβίρουμε με τη γλυκόξινη σάλτσα σε ένα μπολάκι, φύλλα βασιλικού και φέτες από λάιμ.\n", R.drawable.rice_wraps));
        recipes.add(new Recipe("Gazpacho με κολοκυθάκια", "Συστατικά\n" +
                "3 κ.σ. ελαιόλαδο\n" +
                "3 πράσα, το λευκό κομμάτι\n" +
                "1 σκ. σκόρδο\n" +
                "4 κολοκυθάκια, κομμένα σε κομμάτια 2 εκ.\n" +
                "50 γρ. σπόρους κάνναβης + έξτρα, για το σερβίρισμα\n" +
                "χυμός από 2 λεμόνια\n" +
                "700 γρ. νερό\n" +
                "10 φύλλα βασιλικού + έξτρα, για το σερβίρισμα\n" +
                "αλάτι\n" +
                "πιπέρι\n" +
                "¼ κ.γ. μπούκοβο, για το σερβίρισμα\n" +
                "\nΜέθοδος Εκτέλεσης\n" +
                "Ζεσταίνουμε το ελαιόλαδο σε ένα τηγάνι σε μέτρια φωτιά.\n" +
                "Κόβουμε το λευκό κομμάτι από τα πράσα σε λεπτές ροδέλες και σοτάρουμε για 5-6 λεπτά μέχρι να μαλακώσουν αλλά να μην έχουν πάρει πολύ έντονο χρώμα.\n" +
                "Αποσύρουμε το τηγάνι από τη φωτιά, μεταφέρουμε τα πράσα σε ένα μπολ, και αφήνουμε να κρυώσουν για 20 λεπτά.\n" +
                "Μεταφέρουμε σε ένα μπλέντερ τα πράσα μαζί με το σκόρδο, τα κολοκυθάκια, τους σπόρους κάνναβης, τον χυμό λεμονιού, το νερό, τα φύλλα βασιλικού, το αλάτι και το πιπέρι.\n" +
                "Χτυπάμε για 1-2 λεπτά μέχρι να έχουμε ένα ομοιόμορφο και λείο μείγμα.\n" +
                "Σερβίρουμε με τους σπόρους κάνναβης, το μπούκοβο και τα φύλλα βασιλικού.\n", R.drawable.gazpacho_kolokithi));
        recipes.add(new Recipe("Ορτύκια κρασάτα με μυρωδικά", "Συστατικά\n" +
                "6 ορτύκια\n" +
                "40 γρ. ελαιόλαδο\n" +
                "1 κρεμμύδι, ψιλοκομμένο\n" +
                "1 σκ. σκόρδο, ψιλοκομμένο\n" +
                "2 κ.σ. φρέσκο θυμάρι\n" +
                "αλάτι\n" +
                "πιπέρι\n" +
                "1 κ.σ. πελτέ ντομάτας\n" +
                "100 γρ. κόκκινο κρασί\n" +
                "400 γρ. ντομάτα κονκασέ\n" +
                "πουρέ πατάτας, για το σερβίρισμα\n" +
                "φρέσκο θυμάρι, για το σερβίρισμα\n"+
                "\nΜέθοδος Εκτέλεσης\n" +
                "Κόβουμε τα ορτύκια με ψαλίδι κουζίνας, κατά μήκος της σπονδυλικής στήλης. Αφαιρούμε τη σπονδυλική στήλη.\n" +
                "Μεταφέρουμε σε ένα μπολ τα ορτύκια.\n" +
                "Προσθέτουμε στο μπολ το μισό ελαιόλαδο, το ψιλοκομμένο κρεμμύδι, το ψιλοκομμένο σκόρδο, το θυμάρι, το αλάτι και το πιπέρι.\n" +
                "Ζεσταίνουμε το υπόλοιπο ελαιόλαδο σε μια κατσαρόλα σε μέτρια φωτιά και σοτάρουμε τα ορτύκια μαζί με τα υπόλοιπα υλικά του μπολ για 1-2 λεπτά από κάθε πλευρά μέχρι να ροδίσουν.\n" +
                "Προσθέτουμε τον πελτέ ντομάτας και ανακατεύουμε για 1 λεπτό.\n" +
                "Σβήνουμε με το κρασί και αφήνουμε να εξατμιστεί η μισή ποσότητα.\n" +
                "Προσθέτουμε την ντομάτα κονκασέ και καπακώνουμε.\n" +
                "Σιγοβράζουμε για 15 λεπτά.\n" +
                "Αποσύρουμε την κατσαρόλα από τη φωτιά και σερβίρουμε με πουρέ πατάτας και λίγο φρέσκο θυμάρι.\n", R.drawable.ortikia_krasata));

        return recipes;
    }
}
